In [1]:
import pandas as pd
import numpy as np

In [2]:
bronze=pd.read_csv('bronze_top5.csv')
silver=pd.read_csv('silver_top5.csv')

In [3]:
bronze.head()

          Country   Total
0   United States  1052.0
1    Soviet Union   584.0
2  United Kingdom   505.0
3          France   475.0
4         Germany   454.0

In [4]:
silver.head()

          Country   Total
0   United States  1195.0
1    Soviet Union   627.0
2  United Kingdom   591.0
3          France   461.0
4           Italy   394.0

In [6]:
bronze['NOC']=['USA','SOV','UKD','FRA','GER']

In [7]:
bronze_cols=['NOC','Country','Total']
bronze=bronze[bronze_cols]
print(bronze)

   NOC         Country   Total
0  USA   United States  1052.0
1  SOV    Soviet Union   584.0
2  UKD  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [8]:
silver['NOC']=['USA','SOV','UKD','FRA','ITY']

In [9]:
silver_cols=['NOC','Country','Total']
silver=silver[silver_cols]
print(silver)

   NOC         Country   Total
0  USA   United States  1195.0
1  SOV    Soviet Union   627.0
2  UKD  United Kingdom   591.0
3  FRA          France   461.0
4  ITY           Italy   394.0

In [11]:
pd.merge(bronze,silver)

Empty DataFrame
Columns: [NOC, Country, Total]
Index: []

In [12]:
pd.merge(bronze,silver,on='NOC')

   NOC       Country_x  Total_x       Country_y  Total_y
0  USA   United States   1052.0   United States   1195.0
1  SOV    Soviet Union    584.0    Soviet Union    627.0
2  UKD  United Kingdom    505.0  United Kingdom    591.0
3  FRA          France    475.0          France    461.0

In [13]:
pd.merge(bronze,silver,on=['NOC',"Country"])

   NOC         Country  Total_x  Total_y
0  USA   United States   1052.0   1195.0
1  SOV    Soviet Union    584.0    627.0
2  UKD  United Kingdom    505.0    591.0
3  FRA          France    475.0    461.0

In [14]:
pd.merge(bronze,silver,on=['NOC',"Country"],suffixes=['_bronze_medals','_silver_medals'])

   NOC         Country  Total_bronze_medals  Total_silver_medals
0  USA   United States               1052.0               1195.0
1  SOV    Soviet Union                584.0                627.0
2  UKD  United Kingdom                505.0                591.0
3  FRA          France                475.0                461.0

In [15]:
pd.merge(bronze,silver,on=['NOC',"Country"],suffixes=['_bronze_medals','_silver_medals'],how='inner')

   NOC         Country  Total_bronze_medals  Total_silver_medals
0  USA   United States               1052.0               1195.0
1  SOV    Soviet Union                584.0                627.0
2  UKD  United Kingdom                505.0                591.0
3  FRA          France                475.0                461.0